-- create a temp table 
-- 開頭的暫時資料表為屬於 createcreatecreate createcreate的操作者所有的操作者所有 , 
--別的使用者看 不到 ;當操作者 log out log out log out 後,暫時資料表就會被系統移除


CREATE table #temp3 (
    std_id nchar(10),
    credits int
    )

--統計每個人的學分總數 , 放到 #temp3
INSERT into #temp3(std_id,credits)
SELECT r.Std_Id,sum(c.Credit)    --c is refering to table course, LOOK line 9
from course c, record r          -- name tabkle course as c, name record as r, so at line 8 can use this
where c.course_id = r.course_id  --告知那些table有一樣的屬性
GROUP BY std_id;


-- check temp#3   
select * from #temp3


--TEMP#3
std_id     credits
---------- -----------
B1000001   14
B1000002   13
B1000003   18
B1000004   10
B1000005   21
B1000006   11
B1000007   13


-- TABLE student
Std_Id     Std_Name                       Sex   Dep_Id     Religion   Club_Id
---------- ------------------------------ ----- ---------- ---------- ----------
A00000     林黛玉                            0     ANTH       R005       C002      
B1000006   許育瑋                            1     ANTH       R002       C001      
B1000007   徐兆瑋                            0     ANTH       R002       C004      
B1000008   陳承芬                            0     ANTH       R001       C004  


-- COURSE 
Course_Id  Course_Name                                                                                                                                                                                                                                                     Credit                 Acad_Year              Sem_Id                 Teacher_Id
---------- --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- ---------------------- ---------------------- ---------------------- ---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
099A1300   微生物的妙用                                                                                                                                                                                                                                                          3                      99                     2                      王瑜琦
099A1600   健康疾病與人類發展                                                                                                                                                                                                                                                       4                      99                     2                      吳承寯
099A1700   健康醫學密碼                                                                                                                                                                                                                                                          2                      99                     2                      鄧又寧
099A1800   流行病學與族群健康                                                                                                                                                                                                                                                       3                      99                     2                      謝宗仁
099A1910   看不見的敵人:細菌                                                                                                                                                                                                                                                       2                      99                     2                      王莉萩
099A1920   看不見的敵人:病毒                                                                                                                                                                                                                                                       2                      99                     2                      王莉萩
099A2000   疼痛面面觀                                                                                                                                                                                                                                                           2                      99                     2                      何昱征
099A2010   神經面面觀  

--TABLE record

Course_Id  Std_Id     Rcd
---------- ---------- ----------------------
099A1300   B1000008   71
099A1300   B1000022   57.5
099A1300   B1000034   65
099A1300   B1000036   60.5
099A1300   B1000048   62
099A1300   Z7612730   62
099A1300   Z7671191   66
099A1300   Z8904025   88
099A1300   Z9903014   84